In [1]:
import pandas as pd
import numpy as np

df_za = pd.read_csv("../data/Learner_Performance_Pre.csv")

df_za.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 121 entries, 0 to 120
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   learner_id         121 non-null    object
 1   gender             120 non-null    object
 2   age                121 non-null    int64
 3   region             121 non-null    object
 4   classes_attended   121 non-null    int64
 5   total_classes      121 non-null    int64
 6   exam_score         120 non-null    object
 7   completion_status  121 non-null    object
 8   career_path        121 non-null    object
dtypes: int64(3), object(6)
memory usage: 8.6+ KB

In [2]:
df_les = pd.read_csv("../data/learner_data_lesotho.csv")

df_les.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 190 entries, 0 to 189
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   learner_id         190 non-null    object
 1   gender             183 non-null    object
 2   age                188 non-null    float64
 3   region             190 non-null    object
 4   classes_attended   189 non-null    float64
 5   total_classes      190 non-null    int64
 6   exam_score         179 non-null    float64
 7   completion_status  190 non-null    object
 8   career_path        190 non-null    object
dtypes: float64(3), int64(1), object(5)
memory usage: 13.5+ KB

In [3]:
df_za.isna().sum()

learner_id           0
gender               1
age                  0
region               0
classes_attended     0
total_classes        0
exam_score           1
completion_status    0
career_path          0
dtype: int64

In [4]:
df_les.isna().sum()

learner_id            0
gender                7
age                   2
region                0
classes_attended      1
total_classes         0
exam_score           11
completion_status     0
career_path           0
dtype: int64

In [5]:
df_za["country"] = "za"
df_za

,learner_id,gender,age,region,classes_attended,total_classes,exam_score,completion_status,career_path,country
0,L1000,Male,33,KwaZulu-Natal,26,40,83.0,Not Completed,Seeking Employment,za
1,L1001,Female,30,Eastern Cape,23,40,45.0,Not Completed,Further Studies,za
2,L1002,Male,32,Eastern Cape,32,40,88.0,Completed,Entrepreneurship,za
3,L1003,Male,30,Gauteng,39,40,50.0,Completed,Entrepreneurship,za
4,L1004,Male,26,Gauteng,20,40,46.0,Not Completed,Seeking Employment,za
...,...,...,...,...,...,...,...,...,...,...
116,L1116,Male,33,Western Cape,21,40,70.0,Not Completed,Seeking Employment,za
117,L1117,Female,20,Gauteng,38,40,64.0,Completed,Entrepreneurship,za
118,L1118,Female,21,Free State,37,40,85.0,Completed,Entrepreneurship,za
119,L1119,Male,20,Eastern Cape,22,40,54.0,Not Completed,Entrepreneurship,za
120,L1025,Female,25,KwaZulu-Natal,31,40,77.0,Completed,Seeking Employment,za

In [6]:
df_les["country"] = "les"
df_les

,learner_id,gender,age,region,classes_attended,total_classes,exam_score,completion_status,career_path,country
0,L2001,Female,19.0,Maseru,26.0,40,52.7,Completed,Further Studies,les
1,L2002,Female,25.0,Berea,36.0,40,66.8,Not Completed,Seeking Employment,les
2,L2003,Male,27.0,Maseru,16.0,40,88.2,Completed,Seeking Employment,les
3,L2004,NaN,31.0,Maseru,24.0,40,67.4,Not Completed,Seeking Employment,les
4,L2005,Female,26.0,Quthing,18.0,40,63.4,Completed,Further Studies,les
...,...,...,...,...,...,...,...,...,...,...
185,L2186,Female,28.0,Mokhotlong,23.0,40,81.3,Completed,Entrepreneurship,les
186,L2187,Female,27.0,Qacha's Nek,26.0,40,72.2,Not Completed,Entrepreneurship,les
187,L2188,Female,29.0,Berea,35.0,40,68.2,Completed,Self-Employed,les
188,L2189,Female,NaN,Butha-Buthe,29.0,40,95.7,Not Completed,Entrepreneurship,les
189,L2190,Male,19.0,Thaba-Tseka,19.0,40,90.3,Not Completed,Further Studies,les

In [7]:
df = pd.merge(df_za, df_les) # generates error

ValueError: You are trying to merge on object and float64 columns for key 'exam_score'. If you wish to proceed you should use pd.concat

In [8]:
df_za["age"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 121 entries, 0 to 120
Series name: age
Non-Null Count  Dtype
--------------  -----
121 non-null    int64
dtypes: int64(1)
memory usage: 1.1 KB

In [9]:
df_za["exam_score"] = df_za["exam_score"].astype("float64") # generates an error

ValueError: could not convert string to float: 'eighty'

In [10]:
anomaly = df_za[df_za["exam_score"] == "eighty"]
anomaly

,learner_id,gender,age,region,classes_attended,total_classes,exam_score,completion_status,career_path,country
40,L1040,Male,20,KwaZulu-Natal,29,40,eighty,Not Completed,Seeking Employment,za

In [11]:
df_za.loc[40,"exam_score"] = 80.0
df_za.loc[40]

learner_id                        L1040
gender                             Male
age                                  20
region                    KwaZulu-Natal
classes_attended                     29
total_classes                        40
exam_score                         80.0
completion_status         Not Completed
career_path          Seeking Employment
country                              za
Name: 40, dtype: object

In [12]:
df_za["age"] = df_za["age"].astype("Int64")
df_za["classes_attended"] = df_za["classes_attended"].astype("Int64")
df_za["total_classes"] = df_za["total_classes"].astype("Int64")
df_za["exam_score"] = df_za["exam_score"].astype("float64")
df_za.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 121 entries, 0 to 120
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   learner_id         121 non-null    object
 1   gender             120 non-null    object
 2   age                121 non-null    Int64
 3   region             121 non-null    object
 4   classes_attended   121 non-null    Int64
 5   total_classes      121 non-null    Int64
 6   exam_score         120 non-null    float64
 7   completion_status  121 non-null    object
 8   career_path        121 non-null    object
 9   country            121 non-null    object
dtypes: Int64(3), float64(1), object(6)
memory usage: 9.9+ KB

In [13]:
df_za.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 121 entries, 0 to 120
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   learner_id         121 non-null    object
 1   gender             120 non-null    object
 2   age                121 non-null    Int64
 3   region             121 non-null    object
 4   classes_attended   121 non-null    Int64
 5   total_classes      121 non-null    Int64
 6   exam_score         120 non-null    float64
 7   completion_status  121 non-null    object
 8   career_path        121 non-null    object
 9   country            121 non-null    object
dtypes: Int64(3), float64(1), object(6)
memory usage: 9.9+ KB

In [14]:
df_les["age"] = df_les["age"].astype("Int64")
df_les["classes_attended"] = df_les["classes_attended"].astype("Int64")
df_les["total_classes"] = df_les["total_classes"].astype("Int64")

df_les.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 190 entries, 0 to 189
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   learner_id         190 non-null    object
 1   gender             183 non-null    object
 2   age                188 non-null    Int64
 3   region             190 non-null    object
 4   classes_attended   189 non-null    Int64
 5   total_classes      190 non-null    Int64
 6   exam_score         179 non-null    float64
 7   completion_status  190 non-null    object
 8   career_path        190 non-null    object
 9   country            190 non-null    object
dtypes: Int64(3), float64(1), object(6)
memory usage: 15.5+ KB

In [15]:
missing_exam_score = df_za[df_za["exam_score"].isna()]
missing_exam_score

,learner_id,gender,age,region,classes_attended,total_classes,exam_score,completion_status,career_path,country
10,L1010,Male,18,Gauteng,38,40,NaN,Completed,Entrepreneurship,za

In [16]:
df_za.loc[10, "exam_score"] = 0

avg_exam_score = np.average(df_za["exam_score"])
avg_exam_score

df_za.loc[10, "exam_score"] = avg_exam_score.round()
df_za.iloc[10]

learner_id                      L1010
gender                           Male
age                                18
region                        Gauteng
classes_attended                   38
total_classes                      40
exam_score                       63.0
completion_status           Completed
career_path          Entrepreneurship
country                            za
Name: 10, dtype: object

In [17]:
missing_gender = df_za[df_za["gender"].isna()]
missing_gender

,learner_id,gender,age,region,classes_attended,total_classes,exam_score,completion_status,career_path,country
5,L1005,NaN,32,Western Cape,27,40,52.0,Not Completed,Seeking Employment,za

In [18]:
df_za.groupby("gender").count()["learner_id"]

gender
Female    70
Male      50
Name: learner_id, dtype: int64

In [19]:
df_za.loc[5, "gender"] = "Male"
df_za.isna().sum()

learner_id           0
gender               0
age                  0
region               0
classes_attended     0
total_classes        0
exam_score           0
completion_status    0
career_path          0
country              0
dtype: int64

In [20]:
duplicates = df_za[df_za.duplicated(keep=False)]
duplicates

,learner_id,gender,age,region,classes_attended,total_classes,exam_score,completion_status,career_path,country
25,L1025,Female,25,KwaZulu-Natal,31,40,77.0,Completed,Seeking Employment,za
120,L1025,Female,25,KwaZulu-Natal,31,40,77.0,Completed,Seeking Employment,za

In [21]:
df_za = df_za.drop_duplicates()

In [22]:
df_za

,learner_id,gender,age,region,classes_attended,total_classes,exam_score,completion_status,career_path,country
0,L1000,Male,33,KwaZulu-Natal,26,40,83.0,Not Completed,Seeking Employment,za
1,L1001,Female,30,Eastern Cape,23,40,45.0,Not Completed,Further Studies,za
2,L1002,Male,32,Eastern Cape,32,40,88.0,Completed,Entrepreneurship,za
3,L1003,Male,30,Gauteng,39,40,50.0,Completed,Entrepreneurship,za
4,L1004,Male,26,Gauteng,20,40,46.0,Not Completed,Seeking Employment,za
...,...,...,...,...,...,...,...,...,...,...
115,L1115,Female,23,KwaZulu-Natal,33,40,58.0,Completed,Further Studies,za
116,L1116,Male,33,Western Cape,21,40,70.0,Not Completed,Seeking Employment,za
117,L1117,Female,20,Gauteng,38,40,64.0,Completed,Entrepreneurship,za
118,L1118,Female,21,Free State,37,40,85.0,Completed,Entrepreneurship,za
119,L1119,Male,20,Eastern Cape,22,40,54.0,Not Completed,Entrepreneurship,za

In [23]:
df_za.to_csv("../data/cleaned/learner_performance_za.csv")

In [24]:
df_les.isna().sum()

learner_id            0
gender                7
age                   2
region                0
classes_attended      1
total_classes         0
exam_score           11
completion_status     0
career_path           0
country               0
dtype: int64

In [25]:
df_les[df_les.exam_score.isna()]

,learner_id,gender,age,region,classes_attended,total_classes,exam_score,completion_status,career_path,country
7,L2008,Female,27,Mafeteng,21,40,NaN,Completed,Seeking Employment,les
11,L2012,Male,30,Quthing,38,40,NaN,Completed,Entrepreneurship,les
81,L2082,Male,29,Mafeteng,34,40,NaN,Completed,Entrepreneurship,les
87,L2088,Female,21,Mokhotlong,38,40,NaN,Not Completed,Seeking Employment,les
93,L2094,Female,35,Quthing,40,40,NaN,Not Completed,Self-Employed,les
108,L2109,Female,35,Mafeteng,28,40,NaN,Not Completed,Seeking Employment,les
119,L2120,Female,22,Leribe,15,40,NaN,Completed,Self-Employed,les
142,L2143,NaN,18,Berea,23,40,NaN,Completed,Entrepreneurship,les
153,L2154,Male,23,Mafeteng,36,40,NaN,Completed,Self-Employed,les
167,L2168,Male,26,Mokhotlong,35,40,NaN,Completed,Further Studies,les
182,L2183,Male,24,Mafeteng,29,40,NaN,Not Completed,Entrepreneurship,les

In [26]:
df_les["exam_score"] = df_les["exam_score"].fillna(df_les["exam_score"].mean())
df_les["exam_score"].isna().sum()

np.int64(0)

In [27]:
[df_les.iloc[7]["exam_score"], df_les.iloc[11]["exam_score"], df_les.iloc[81]["exam_score"]]

[np.float64(67.7804469273743),
 np.float64(67.7804469273743),
 np.float64(67.7804469273743)]

In [28]:
df_les.groupby("gender").count()

,learner_id,age,region,classes_attended,total_classes,exam_score,completion_status,career_path,country
gender,,,,,,,,,
Female,115,113,115,114,115,115,115,115,115
Male,68,68,68,68,68,68,68,68,68

In [29]:
df_les["gender"] = df_les["gender"].fillna("Female")

df_les.groupby("gender").count()["learner_id"]

gender
Female    122
Male       68
Name: learner_id, dtype: int64

In [30]:
avg_age = df_les["age"].mean()
df_les["age"] = df_les["age"].fillna(int(avg_age))

print("average age:", avg_age)


avg_classes_att = df_les["classes_attended"].mean()
df_les["classes_attended"] = df_les["classes_attended"].fillna(int(avg_classes_att))

print("average class attendance: ", avg_classes_att)

average age: 26.27659574468085
average class attendance:  27.116402116402117

In [31]:
df_les.isna().sum()

learner_id           0
gender               0
age                  0
region               0
classes_attended     0
total_classes        0
exam_score           0
completion_status    0
career_path          0
country              0
dtype: int64

In [32]:
df_les.to_csv("../data/cleaned/learner_performance_lesotho.csv")

In [33]:
df_za.dtypes, df_les.dtypes

(learner_id            object
 gender                object
 age                    Int64
 region                object
 classes_attended       Int64
 total_classes          Int64
 exam_score           float64
 completion_status     object
 career_path           object
 country               object
 dtype: object,
 learner_id            object
 gender                object
 age                    Int64
 region                object
 classes_attended       Int64
 total_classes          Int64
 exam_score           float64
 completion_status     object
 career_path           object
 country               object
 dtype: object)

In [34]:
df = pd.concat([df_za, df_les], ignore_index=True)
df

,learner_id,gender,age,region,classes_attended,total_classes,exam_score,completion_status,career_path,country
0,L1000,Male,33,KwaZulu-Natal,26,40,83.0,Not Completed,Seeking Employment,za
1,L1001,Female,30,Eastern Cape,23,40,45.0,Not Completed,Further Studies,za
2,L1002,Male,32,Eastern Cape,32,40,88.0,Completed,Entrepreneurship,za
3,L1003,Male,30,Gauteng,39,40,50.0,Completed,Entrepreneurship,za
4,L1004,Male,26,Gauteng,20,40,46.0,Not Completed,Seeking Employment,za
...,...,...,...,...,...,...,...,...,...,...
305,L2186,Female,28,Mokhotlong,23,40,81.3,Completed,Entrepreneurship,les
306,L2187,Female,27,Qacha's Nek,26,40,72.2,Not Completed,Entrepreneurship,les
307,L2188,Female,29,Berea,35,40,68.2,Completed,Self-Employed,les
308,L2189,Female,26,Butha-Buthe,29,40,95.7,Not Completed,Entrepreneurship,les
309,L2190,Male,19,Thaba-Tseka,19,40,90.3,Not Completed,Further Studies,les

In [35]:
df.to_csv("../data/cleaned/combined_learner_performance.csv")

In [36]:
df["gender"] = df["gender"].map({'Male': 1, 'Female': 0})
df

,learner_id,gender,age,region,classes_attended,total_classes,exam_score,completion_status,career_path,country
0,L1000,1,33,KwaZulu-Natal,26,40,83.0,Not Completed,Seeking Employment,za
1,L1001,0,30,Eastern Cape,23,40,45.0,Not Completed,Further Studies,za
2,L1002,1,32,Eastern Cape,32,40,88.0,Completed,Entrepreneurship,za
3,L1003,1,30,Gauteng,39,40,50.0,Completed,Entrepreneurship,za
4,L1004,1,26,Gauteng,20,40,46.0,Not Completed,Seeking Employment,za
...,...,...,...,...,...,...,...,...,...,...
305,L2186,0,28,Mokhotlong,23,40,81.3,Completed,Entrepreneurship,les
306,L2187,0,27,Qacha's Nek,26,40,72.2,Not Completed,Entrepreneurship,les
307,L2188,0,29,Berea,35,40,68.2,Completed,Self-Employed,les
308,L2189,0,26,Butha-Buthe,29,40,95.7,Not Completed,Entrepreneurship,les
309,L2190,1,19,Thaba-Tseka,19,40,90.3,Not Completed,Further Studies,les

In [37]:
df["completion_status"] = df["completion_status"].map({"Completed": 1, "Not Completed": 0})

df

,learner_id,gender,age,region,classes_attended,total_classes,exam_score,completion_status,career_path,country
0,L1000,1,33,KwaZulu-Natal,26,40,83.0,0,Seeking Employment,za
1,L1001,0,30,Eastern Cape,23,40,45.0,0,Further Studies,za
2,L1002,1,32,Eastern Cape,32,40,88.0,1,Entrepreneurship,za
3,L1003,1,30,Gauteng,39,40,50.0,1,Entrepreneurship,za
4,L1004,1,26,Gauteng,20,40,46.0,0,Seeking Employment,za
...,...,...,...,...,...,...,...,...,...,...
305,L2186,0,28,Mokhotlong,23,40,81.3,1,Entrepreneurship,les
306,L2187,0,27,Qacha's Nek,26,40,72.2,0,Entrepreneurship,les
307,L2188,0,29,Berea,35,40,68.2,1,Self-Employed,les
308,L2189,0,26,Butha-Buthe,29,40,95.7,0,Entrepreneurship,les
309,L2190,1,19,Thaba-Tseka,19,40,90.3,0,Further Studies,les

In [38]:
gender_counts = df.gender.value_counts().rename({1: 'Male', 0: 'Female'})
gender_counts.columns = ["gender", "total"]
gender_counts

gender
Female    191
Male      119
Name: count, dtype: int64

In [39]:
completion_per = (df.groupby('gender')["completion_status"].mean().reset_index())

completion_per['completion_percent'] = completion_per['completion_status'] * 100
completion_per

   gender  completion_status  completion_percent
0       0           0.492147           49.214660
1       1           0.445378           44.537815

In [40]:
df["attendence_rate"] = (df["classes_attended"] / df["total_classes"] * 100).round()
df

,learner_id,gender,age,region,classes_attended,total_classes,exam_score,completion_status,career_path,country,attendence_rate
0,L1000,1,33,KwaZulu-Natal,26,40,83.0,0,Seeking Employment,za,65.0
1,L1001,0,30,Eastern Cape,23,40,45.0,0,Further Studies,za,57.0
2,L1002,1,32,Eastern Cape,32,40,88.0,1,Entrepreneurship,za,80.0
3,L1003,1,30,Gauteng,39,40,50.0,1,Entrepreneurship,za,98.0
4,L1004,1,26,Gauteng,20,40,46.0,0,Seeking Employment,za,50.0
...,...,...,...,...,...,...,...,...,...,...,...
305,L2186,0,28,Mokhotlong,23,40,81.3,1,Entrepreneurship,les,57.0
306,L2187,0,27,Qacha's Nek,26,40,72.2,0,Entrepreneurship,les,65.0
307,L2188,0,29,Berea,35,40,68.2,1,Self-Employed,les,88.0
308,L2189,0,26,Butha-Buthe,29,40,95.7,0,Entrepreneurship,les,72.0
309,L2190,1,19,Thaba-Tseka,19,40,90.3,0,Further Studies,les,48.0

In [41]:
coun = df.groupby("country")["completion_status"].sum()
coun

country
les    88
za     59
Name: completion_status, dtype: int64

In [42]:
df.to_csv("../data/cleaned/combined_learner_performance.csv")